<!--BOOK_INFORMATION-->
<img align="left" style="padding-right:10px;" src="figures/PDSH-cover-small.png">

*This notebook contains an excerpt from the [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do) by Jake VanderPlas; the content is available [on GitHub](https://github.com/jakevdp/PythonDataScienceHandbook).*

*The text is released under the [CC-BY-NC-ND license](https://creativecommons.org/licenses/by-nc-nd/3.0/us/legalcode), and code is released under the [MIT license](https://opensource.org/licenses/MIT). If you find this content useful, please consider supporting the work by [buying the book](http://shop.oreilly.com/product/0636920034919.do)!*

<!--NAVIGATION-->
< [Combining Datasets: Merge and Join](03.07-Merge-and-Join.ipynb) | [Contents](Index.ipynb) | [Pivot Tables](03.09-Pivot-Tables.ipynb) >

<a href="https://colab.research.google.com/github/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.08-Aggregation-and-Grouping.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a>

# Aggregation and Grouping

An essential piece of analysis of large data is efficient summarization: computing aggregations like ``sum()``, ``mean()``, ``median()``, ``min()``, and ``max()``, in which a single number gives insight into the nature of a potentially large dataset.
In this section, we'll explore aggregations in Pandas, from simple operations akin to what we've seen on NumPy arrays, to more sophisticated operations based on the concept of a ``groupby``.

For convenience, we'll use the same ``display`` magic function that we've seen in previous sections:

In [1]:
import pandas as pd

In [5]:
my_series = pd.Series([
    "one name",
    "two names",
    "three names extra",
])
my_series

0             one name
1            two names
2    three names extra
dtype: object

In [6]:
my_series.str.split(expand=True)

       0      1      2
0    one   name   None
1    two  names   None
2  three  names  extra

In [1]:
import pandas as pd

In [2]:
cal_cities = pd.read_csv(
    "data/california_cities.csv",
    index_col="city"
).iloc[:, 1:]
cal_cities.head()

,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
city,,,,,,,,,,,,
Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
Alameda,37.756111,-122.274444,NaN,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
Albany,37.886944,-122.297778,NaN,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

In [ ]:
cal_cities.groupby()

## Planets Data

Here we will use the Planets dataset, available via the [Seaborn package](http://seaborn.pydata.org/) (see [Visualization With Seaborn](04.14-Visualization-With-Seaborn.ipynb)).
It gives information on planets that astronomers have discovered around other stars (known as *extrasolar planets* or *exoplanets* for short). It can be downloaded with a simple Seaborn command:

In [3]:
import seaborn as sns

In [5]:
planets = sns.load_dataset("planets")
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [11]:
def first(series):
    return series.iloc[0]

In [13]:
planets.groupby(["method", "year"])["distance"].agg(first)

method                         year
Astrometry                     2010      14.98
                               2013      20.77
Eclipse Timing Variations      2008     130.72
                               2009        NaN
                               2010     500.00
                               2011        NaN
                               2012        NaN
Imaging                        2004     140.00
                               2005      45.52
                               2006      18.39
                               2007     165.00
                               2008        NaN
                               2009      12.21
                               2010     140.00
                               2011      23.10
                               2012      52.03
                               2013     145.00
Microlensing                   2004        NaN
                               2005        NaN
                               2006        NaN
                               2008        NaN
                               2009        NaN
                               2010        NaN
                               2011        NaN
                               2012    2300.00
                               2013    3600.00
Orbital Brightness Modulation  2011    1180.00
                               2013        NaN
Pulsar Timing                  1992        NaN
                               1994        NaN
                                        ...
Radial Velocity                2000       3.22
                               2001      14.08
                               2002      18.15
                               2003      13.79
                               2004      12.53
                               2005       6.27
                               2006      77.40
                               2007     110.62
                               2008      56.95
                               2009     119.47
                               2010      74.79
                               2011      19.84
                               2012      81.50
                               2013      45.52
                               2014      20.48
Transit                        2002        NaN
                               2004        NaN
                               2006     139.00
                               2007     135.32
                               2008        NaN
                               2009        NaN
                               2010     380.00
                               2011     840.00
                               2012     249.00
                               2013     360.00
                               2014        NaN
Transit Timing Variations      2011    2119.00
                               2012     855.00
                               2013     339.00
                               2014        NaN
Name: distance, Length: 69, dtype: float64

In [8]:
planets.groupby("method").median()

                               number  orbital_period   mass  distance    year
method
Astrometry                        1.0      631.180000    NaN    17.875  2011.5
Eclipse Timing Variations         2.0     4343.500000  5.125   315.360  2010.0
Imaging                           1.0    27500.000000    NaN    40.395  2009.0
Microlensing                      1.0     3300.000000    NaN  3840.000  2010.0
Orbital Brightness Modulation     2.0        0.342887    NaN  1180.000  2011.0
Pulsar Timing                     3.0       66.541900    NaN  1200.000  1994.0
Pulsation Timing Variations       1.0     1170.000000    NaN       NaN  2007.0
Radial Velocity                   1.0      360.200000  1.260    40.445  2009.0
Transit                           1.0        5.714932  1.470   341.000  2012.0
Transit Timing Variations         2.0       57.011000    NaN   855.000  2012.5

In [7]:
planets.groupby("method")["distance"].median()

method
Astrometry                         17.875
Eclipse Timing Variations         315.360
Imaging                            40.395
Microlensing                     3840.000
Orbital Brightness Modulation    1180.000
Pulsar Timing                    1200.000
Pulsation Timing Variations           NaN
Radial Velocity                    40.445
Transit                           341.000
Transit Timing Variations         855.000
Name: distance, dtype: float64

This has some details on the 1,000+ extrasolar planets discovered up to 2014.

## Simple Aggregation in Pandas

Earlier, we explored some of the data aggregations available for NumPy arrays (["Aggregations: Min, Max, and Everything In Between"](02.04-Computation-on-arrays-aggregates.ipynb)).
As with a one-dimensional NumPy array, for a Pandas ``Series`` the aggregates return a single value:

For a ``DataFrame``, by default the aggregates return results within each column:

By specifying the ``axis`` argument, you can instead aggregate within each row:

Pandas ``Series`` and ``DataFrame``s include all of the common aggregates mentioned in [Aggregations: Min, Max, and Everything In Between](02.04-Computation-on-arrays-aggregates.ipynb); in addition, there is a convenience method ``describe()`` that computes several common aggregates for each column and returns the result.
Let's use this on the Planets data, for now dropping rows with missing values:

This can be a useful way to begin understanding the overall properties of a dataset.
For example, we see in the ``year`` column that although exoplanets were discovered as far back as 1989, half of all known expolanets were not discovered until 2010 or after.
This is largely thanks to the *Kepler* mission, which is a space-based telescope specifically designed for finding eclipsing planets around other stars.

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects.

To go deeper into the data, however, simple aggregates are often not enough.
The next level of data summarization is the ``groupby`` operation, which allows you to quickly and efficiently compute aggregates on subsets of data.

## GroupBy: Split, Apply, Combine

Simple aggregations can give you a flavor of your dataset, but often we would prefer to aggregate conditionally on some label or index: this is implemented in the so-called ``groupby`` operation.
The name "group by" comes from a command in the SQL database language, but it is perhaps more illuminative to think of it in the terms first coined by Hadley Wickham of Rstats fame: *split, apply, combine*.

### Split, apply, combine

A canonical example of this split-apply-combine operation, where the "apply" is a summation aggregation, is illustrated in this figure:

![](figures/03.08-split-apply-combine.png)
[figure source in Appendix](06.00-Figure-Code.ipynb#Split-Apply-Combine)

This makes clear what the ``groupby`` accomplishes:

- The *split* step involves breaking up and grouping a ``DataFrame`` depending on the value of the specified key.
- The *apply* step involves computing some function, usually an aggregate, transformation, or filtering, within the individual groups.
- The *combine* step merges the results of these operations into an output array.

While this could certainly be done manually using some combination of the masking, aggregation, and merging commands covered earlier, an important realization is that *the intermediate splits do not need to be explicitly instantiated*. Rather, the ``GroupBy`` can (often) do this in a single pass over the data, updating the sum, mean, count, min, or other aggregate for each group along the way.
The power of the ``GroupBy`` is that it abstracts away these steps: the user need not think about *how* the computation is done under the hood, but rather thinks about the *operation as a whole*.

As a concrete example, let's take a look at using Pandas for the computation shown in this diagram.
We'll start by creating the input ``DataFrame``:

In [9]:
import seaborn as sns
import os

In [11]:
os.path.join("data", "california_cities.csv")

'data/california_cities.csv'

In [12]:
planets = sns.load_dataset("planets")
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [10]:
cal_cities = pd.read_csv(
    os.path.join("data", "california_cities.csv"),
    index_col="city"
).iloc[:, 1:]
cal_cities.head()

,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
city,,,,,,,,,,,,
Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
Alameda,37.756111,-122.274444,NaN,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
Albany,37.886944,-122.297778,NaN,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

In [15]:
cal_cities["area_land_km2"].min()

0.813

In [28]:
cal_cities.groupby(
    pd.qcut(cal_cities["area_land_km2"], 5)
).agg([
    "mean", "min", "max"
]).drop(columns="population_total")

                                  latd                             longd  \
                                  mean        min        max        mean
area_land_km2
(0.8119999999999999, 7.341]  37.243780  32.811111  41.965000 -120.802151
(7.341, 15.731]              36.320462  32.578333  41.424167 -120.193795
(15.731, 30.107]             35.758075  32.678056  41.726667 -119.635067
(30.107, 59.241]             35.897020  32.798333  39.759722 -119.822882
(59.241, 1214.0]             35.231597  32.627778  40.583333 -118.679161

                                                    elevation_m         \
                                    min         max        mean    min
area_land_km2
(0.8119999999999999, 7.341] -124.263333 -115.380278  185.643678  -3.00
(7.341, 15.731]             -124.157222 -115.514167  143.505747 -18.00
(15.731, 30.107]            -124.163611 -115.498889  163.954023 -34.00
(30.107, 59.241]            -122.631389 -116.341111  114.302326   5.00
(59.241, 1214.0]            -122.704722 -114.596389  293.917816 -20.74

                                    elevation_ft  ... area_total_km2  \
                                max         mean  ...            max
area_land_km2                                     ...
(0.8119999999999999, 7.341]  1509.0   602.621053  ...         24.012
(7.341, 15.731]              1480.0   454.631579  ...         51.999
(15.731, 30.107]             2058.0   506.436170  ...         84.603
(30.107, 59.241]              729.0   350.250000  ...        108.697
(59.241, 1214.0]             2402.0   944.926374  ...       1302.000

                            area_land_km2                   area_water_km2  \
                                     mean     min       max           mean
area_land_km2
(0.8119999999999999, 7.341]      4.401750   0.813     7.325       0.488063
(7.341, 15.731]                 11.098516   7.364    15.655       1.990621
(15.731, 30.107]                21.648917  15.750    30.037       3.656104
(30.107, 59.241]                42.664316  30.386    58.937       2.337726
(59.241, 1214.0]               137.574406  59.444  1214.000       7.133356

                                          area_water_percent
                             min      max               mean  min    max
area_land_km2
(0.8119999999999999, 7.341]  0.0   17.315           5.142947  0.0  80.77
(7.341, 15.731]              0.0   43.981           6.207158  0.0  84.58
(15.731, 30.107]             0.0   64.062           6.909375  0.0  77.96
(30.107, 59.241]             0.0   58.275           3.570737  0.0  53.61
(59.241, 1214.0]             0.0  122.270           3.875568  0.0  55.07

[5 rows x 33 columns]

In [33]:
cal_cities.groupby(
    pd.qcut(cal_cities["area_land_km2"], 5)
).agg({
    "population_total": "mean",
    "area_water_percent": ["median", "min"],
})

                            population_total area_water_percent
                                        mean             median  min
area_land_km2
(0.8119999999999999, 7.341]      8596.083333              0.000  0.0
(7.341, 15.731]                 18965.978947              0.190  0.0
(15.731, 30.107]                41023.197917              0.375  0.0
(30.107, 59.241]                59998.200000              0.410  0.0
(59.241, 1214.0]               187354.177083              0.520  0.0

In [25]:
cal_cities.groupby(
    pd.qcut(cal_cities["area_land_km2"], 5)
)[["population_total", "area_water_percent"]].agg([
    "mean", "min", "max"
])

                            population_total                 \
                                        mean   min      max
area_land_km2
(0.8119999999999999, 7.341]      8596.083333   185    42072
(7.341, 15.731]                 18965.978947   112    69772
(15.731, 30.107]                41023.197917  1422   113475
(30.107, 59.241]                59998.200000   219   170883
(59.241, 1214.0]               187354.177083     1  3884307

                            area_water_percent
                                          mean  min    max
area_land_km2
(0.8119999999999999, 7.341]           5.142947  0.0  80.77
(7.341, 15.731]                       6.207158  0.0  84.58
(15.731, 30.107]                      6.909375  0.0  77.96
(30.107, 59.241]                      3.570737  0.0  53.61
(59.241, 1214.0]                      3.875568  0.0  55.07

In [14]:
pd.cut(cal_cities["area_land_km2"], 5)

city
Adelanto              (-0.4, 243.45]
AgouraHills           (-0.4, 243.45]
Alameda               (-0.4, 243.45]
Albany                (-0.4, 243.45]
Alhambra              (-0.4, 243.45]
AlisoViejo            (-0.4, 243.45]
Alturas               (-0.4, 243.45]
AmadorCity            (-0.4, 243.45]
AmericanCanyon        (-0.4, 243.45]
Anaheim               (-0.4, 243.45]
Anderson              (-0.4, 243.45]
AngelsCamp            (-0.4, 243.45]
Antioch               (-0.4, 243.45]
AppleValley           (-0.4, 243.45]
Arcadia               (-0.4, 243.45]
Arcata                (-0.4, 243.45]
ArroyoGrande          (-0.4, 243.45]
Artesia               (-0.4, 243.45]
Arvin                 (-0.4, 243.45]
Atascadero            (-0.4, 243.45]
Atherton              (-0.4, 243.45]
Atwater               (-0.4, 243.45]
Auburn                (-0.4, 243.45]
Avalon                (-0.4, 243.45]
Avenal                (-0.4, 243.45]
Azusa                 (-0.4, 243.45]
Bakersfield        (243.45, 486.088]
BaldwinPark           (-0.4, 243.45]
Banning               (-0.4, 243.45]
Barstow               (-0.4, 243.45]
                         ...
Vista                 (-0.4, 243.45]
Walnut                (-0.4, 243.45]
WalnutCreek           (-0.4, 243.45]
Wasco                 (-0.4, 243.45]
Waterford             (-0.4, 243.45]
Watsonville           (-0.4, 243.45]
Weed                  (-0.4, 243.45]
WestCovina            (-0.4, 243.45]
WestHollywood         (-0.4, 243.45]
WestlakeVillage       (-0.4, 243.45]
Westminster           (-0.4, 243.45]
Westmorland           (-0.4, 243.45]
WestSacramento        (-0.4, 243.45]
Wheatland             (-0.4, 243.45]
Whittier              (-0.4, 243.45]
Wildomar              (-0.4, 243.45]
Williams              (-0.4, 243.45]
Willits               (-0.4, 243.45]
Willows               (-0.4, 243.45]
Windsor               (-0.4, 243.45]
Winters               (-0.4, 243.45]
Woodlake              (-0.4, 243.45]
Woodland              (-0.4, 243.45]
Woodside              (-0.4, 243.45]
YorbaLinda            (-0.4, 243.45]
Yountville            (-0.4, 243.45]
Yreka                 (-0.4, 243.45]
YubaCity              (-0.4, 243.45]
Yucaipa               (-0.4, 243.45]
YuccaValley           (-0.4, 243.45]
Name: area_land_km2, Length: 482, dtype: category
Categories (5, interval[float64]): [(-0.4, 243.45] < (243.45, 486.088] < (486.088, 728.725] < (728.725, 971.363] < (971.363, 1214.0]]

In [34]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [42]:
#planets.set_index("year", drop=False).sort_index()

In [46]:
#planets.set_index("year").reset_index()

In [63]:
planets.set_index("year").sort_index().loc[:1994]

               method  number  orbital_period   mass  distance
year
1989  Radial Velocity       1         83.8880  11.68     40.57
1992    Pulsar Timing       3         66.5419    NaN       NaN
1992    Pulsar Timing       3         25.2620    NaN       NaN
1994    Pulsar Timing       3         98.2114    NaN       NaN

In [77]:
index = pd.Series(
    "Before 2000",
    index=planets["year"]
).sort_index()

index.loc[2000:] = "After 2000"

In [79]:
planets.set_index("year").sort_index().groupby(index).agg({
    "number": ["sum"],
    "distance": ["mean"],
})

            number    distance
               sum        mean
After 2000    1786  272.918742
Before 2000     62   26.354483

In [80]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [83]:
planets.index.is_unique

True

In [85]:
planets.index.is_monotonic

True

In [86]:
planets.index.is_monotonic_increasing

True

In [81]:
planets.loc[planets["year"] < 2000, "year_period"] = "Before 2000"
planets.loc[planets["year"] >= 2000, "year_period"] = "After 2000"

In [82]:
planets.groupby("year_period").agg({
    "number": ["sum"],
    "distance": ["mean"],
})

            number    distance
               sum        mean
year_period
After 2000    1786  272.918742
Before 2000     62   26.354483

In [49]:
planets.set_index("year").groupby([{
    2006: "A",
    2007: "A",
    2008: "B",
}, "method"]).mean()

                                 number  orbital_period      mass     distance
  method
A Imaging                      1.000000   730000.000000       NaN    74.746667
  Microlensing                 1.000000     3300.000000       NaN          NaN
  Pulsation Timing Variations  1.000000     1170.000000       NaN          NaN
  Radial Velocity              1.428571      602.124889  2.970442    53.928824
  Transit                      1.000000        3.104752       NaN  1201.648421
B Eclipse Timing Variations    2.000000     4544.000000       NaN   130.720000
  Imaging                      2.125000   120056.000000       NaN    48.631667
  Microlensing                 1.500000     3462.500000       NaN          NaN
  Radial Velocity              1.767442      741.466230  3.424339    56.967674
  Transit                      1.000000        3.431441       NaN   254.823077

The most basic split-apply-combine operation can be computed with the ``groupby()`` method of ``DataFrame``s, passing the name of the desired key column:

Notice that what is returned is not a set of ``DataFrame``s, but a ``DataFrameGroupBy`` object.
This object is where the magic is: you can think of it as a special view of the ``DataFrame``, which is poised to dig into the groups but does no actual computation until the aggregation is applied.
This "lazy evaluation" approach means that common aggregates can be implemented very efficiently in a way that is almost transparent to the user.

To produce a result, we can apply an aggregate to this ``DataFrameGroupBy`` object, which will perform the appropriate apply/combine steps to produce the desired result:

The ``sum()`` method is just one possibility here; you can apply virtually any common Pandas or NumPy aggregation function, as well as virtually any valid ``DataFrame`` operation, as we will see in the following discussion.

### The GroupBy object

The ``GroupBy`` object is a very flexible abstraction.
In many ways, you can simply treat it as if it's a collection of ``DataFrame``s, and it does the difficult things under the hood. Let's see some examples using the Planets data.

Perhaps the most important operations made available by a ``GroupBy`` are *aggregate*, *filter*, *transform*, and *apply*.
We'll discuss each of these more fully in ["Aggregate, Filter, Transform, Apply"](#Aggregate,-Filter,-Transform,-Apply), but before that let's introduce some of the other functionality that can be used with the basic ``GroupBy`` operation.

#### Column indexing

The ``GroupBy`` object supports column indexing in the same way as the ``DataFrame``, and returns a modified ``GroupBy`` object.
For example:

Here we've selected a particular ``Series`` group from the original ``DataFrame`` group by reference to its column name.
As with the ``GroupBy`` object, no computation is done until we call some aggregate on the object:

This gives an idea of the general scale of orbital periods (in days) that each method is sensitive to.

#### Iteration over groups

The ``GroupBy`` object supports direct iteration over the groups, returning each group as a ``Series`` or ``DataFrame``:

This can be useful for doing certain things manually, though it is often much faster to use the built-in ``apply`` functionality, which we will discuss momentarily.

#### Dispatch methods

Through some Python class magic, any method not explicitly implemented by the ``GroupBy`` object will be passed through and called on the groups, whether they are ``DataFrame`` or ``Series`` objects.
For example, you can use the ``describe()`` method of ``DataFrame``s to perform a set of aggregations that describe each group in the data:

Looking at this table helps us to better understand the data: for example, the vast majority of planets have been discovered by the Radial Velocity and Transit methods, though the latter only became common (due to new, more accurate telescopes) in the last decade.
The newest methods seem to be Transit Timing Variation and Orbital Brightness Modulation, which were not used to discover a new planet until 2011.

This is just one example of the utility of dispatch methods.
Notice that they are applied *to each individual group*, and the results are then combined within ``GroupBy`` and returned.
Again, any valid ``DataFrame``/``Series`` method can be used on the corresponding ``GroupBy`` object, which allows for some very flexible and powerful operations!

### Aggregate, filter, transform, apply

The preceding discussion focused on aggregation for the combine operation, but there are more options available.
In particular, ``GroupBy`` objects have ``aggregate()``, ``filter()``, ``transform()``, and ``apply()`` methods that efficiently implement a variety of useful operations before combining the grouped data.

For the purpose of the following subsections, we'll use this ``DataFrame``:

#### Aggregation

We're now familiar with ``GroupBy`` aggregations with ``sum()``, ``median()``, and the like, but the ``aggregate()`` method allows for even more flexibility.
It can take a string, a function, or a list thereof, and compute all the aggregates at once.
Here is a quick example combining all these:

Another useful pattern is to pass a dictionary mapping column names to operations to be applied on that column:

#### Filtering

A filtering operation allows you to drop data based on the group properties.
For example, we might want to keep all groups in which the standard deviation is larger than some critical value:

The filter function should return a Boolean value specifying whether the group passes the filtering. Here because group A does not have a standard deviation greater than 4, it is dropped from the result.

#### Transformation

While aggregation must return a reduced version of the data, transformation can return some transformed version of the full data to recombine.
For such a transformation, the output is the same shape as the input.
A common example is to center the data by subtracting the group-wise mean:

#### The apply() method

The ``apply()`` method lets you apply an arbitrary function to the group results.
The function should take a ``DataFrame``, and return either a Pandas object (e.g., ``DataFrame``, ``Series``) or a scalar; the combine operation will be tailored to the type of output returned.

For example, here is an ``apply()`` that normalizes the first column by the sum of the second:

``apply()`` within a ``GroupBy`` is quite flexible: the only criterion is that the function takes a ``DataFrame`` and returns a Pandas object or scalar; what you do in the middle is up to you!

### Specifying the split key

In the simple examples presented before, we split the ``DataFrame`` on a single column name.
This is just one of many options by which the groups can be defined, and we'll go through some other options for group specification here.

#### A list, array, series, or index providing the grouping keys

The key can be any series or list with a length matching that of the ``DataFrame``. For example:

Of course, this means there's another, more verbose way of accomplishing the ``df.groupby('key')`` from before:

#### A dictionary or series mapping index to group

Another method is to provide a dictionary that maps index values to the group keys:

#### Any Python function

Similar to mapping, you can pass any Python function that will input the index value and output the group:

#### A list of valid keys

Further, any of the preceding key choices can be combined to group on a multi-index:

### Grouping example

As an example of this, in a couple lines of Python code we can put all these together and count discovered planets by method and by decade:

This shows the power of combining many of the operations we've discussed up to this point when looking at realistic datasets.
We immediately gain a coarse understanding of when and how planets have been discovered over the past several decades!

Here I would suggest digging into these few lines of code, and evaluating the individual steps to make sure you understand exactly what they are doing to the result.
It's certainly a somewhat complicated example, but understanding these pieces will give you the means to similarly explore your own data.

<!--NAVIGATION-->
< [Combining Datasets: Merge and Join](03.07-Merge-and-Join.ipynb) | [Contents](Index.ipynb) | [Pivot Tables](03.09-Pivot-Tables.ipynb) >

<a href="https://colab.research.google.com/github/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.08-Aggregation-and-Grouping.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a>